# Ex3 - Getting and Knowing your Data

In [48]:
import pandas as pd

In [49]:
df=pd.read_csv(r'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user',delimiter='|')
df

     user_id  age gender     occupation zip_code
0          1   24      M     technician    85711
1          2   53      F          other    94043
2          3   23      M         writer    32067
3          4   24      M     technician    43537
4          5   33      F          other    15213
..       ...  ...    ...            ...      ...
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

[943 rows x 5 columns]

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

### Step 3. Assign it to a variable called users and use the 'user_id' as index

In [50]:
df=pd.read_csv(r'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user',delimiter='|', index_col='user_id')
df

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

### Step 4. See the first 25 entries

In [51]:
df.head(25)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107

### Step 5. See the last 10 entries

In [52]:
df.tail(10)

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

### Step 6. What is the number of observations in the dataset?

In [53]:
df.size

3772

### Step 7. What is the number of columns in the dataset?

In [54]:
len(df.columns)

4

### Step 8. Print the name of all the columns.

In [55]:
df.columns

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

### Step 9. How is the dataset indexed?

In [112]:
df.index

Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
       ...
       934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
      dtype='int64', name='user_id', length=943)

### Step 10. What is the data type of each column?

In [110]:
df.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

### Step 11. Print only the occupation column

In [66]:
df[['occupation']]

            occupation
user_id
1           technician
2                other
3               writer
4           technician
5                other
...                ...
939            student
940      administrator
941            student
942          librarian
943            student

[943 rows x 1 columns]

### Step 12. How many different occupations there are in this dataset?

In [143]:
df['occupation'].nunique()

21

### Step 13. What is the most frequent occupation?

In [164]:
a = df['occupation'].value_counts().max()
for i ,j in dict(df['occupation'].value_counts()).items():
    if j==a:
        print(i,j)

student 196

In [166]:
df['occupation'].value_counts().max()

196

### Step 14. Summarize the DataFrame.

In [43]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 0 entries
Empty DataFrame

### Step 15. Summarize all the columns

In [134]:
df.describe

<bound method NDFrame.describe of          age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]>

### Step 16. Summarize only the occupation column

In [60]:
df['occupation'].info()

<class 'pandas.core.series.Series'>
Index: 943 entries, 1 to 943
Series name: occupation
Non-Null Count  Dtype
--------------  -----
943 non-null    object
dtypes: object(1)
memory usage: 14.7+ KB

### Step 17. What is the mean age of users?

In [59]:
df['age'].mean()

34.05196182396607

### Step 18. What is the age with least occurrence?

In [98]:
least_occurances=[]

df1=df['age'].value_counts()
for i in df1:
    least_occurances.append(i)
a=least_occurances[-1]



for i,j in dict(df1).items():
    if j==a:
        print(i,end=' ')

7 66 11 10 73

In [159]:

df1=df['age'].value_counts()

a=list(dict(df1.tail(1)).values())[0]

for i,j in dict(df1).items():
    if j==a:
        print(i,end=' ')

7 66 11 10 73

In [158]:
df1=df['age'].value_counts()
df1.tail(1)

age
73    1
Name: count, dtype: int64

In [124]:
list(dict(df1.tail(1)).values())[0]

1

In [137]:
x=df['age'].value_counts().tail()
x[x==1]

age
7     1
66    1
11    1
10    1
73    1
Name: count, dtype: int64

In [144]:
df['age'].value_counts()

age
30    39
25    38
22    37
28    36
27    35
      ..
7      1
66     1
11     1
10     1
73     1
Name: count, Length: 61, dtype: int64

In [ ]:
a=df['occupation'].value_counts().max()